
# yolov8n-2mv3.1-cbaem-c2f_ca-spdconv-小目标检测头-

nc: 1 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8n.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f_CA, [128, True]] #2
  - [-1, 3, CBAM, [128]]  # 3
  - [-1, 1, Conv, [256, 3, 2]]     # 4
  - [-1, 6, MobileViTBv3, [256]]  #5
  - [-1, 1, Conv, [512, 3, 2]]  #6
  - [-1, 6, MobileViTBv3, [512]]  #7
  - [-1, 1, Conv, [1024, 3, 2]]  #8
  - [-1, 3, C2f_CA, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f_CA, [512]] #13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f_CA, [256]] # 16 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]# 17
  - [[-1, 2], 1, Concat, [1]] # 18
  - [-1, 3, C2f_CA, [128]] #19

  - [-1, 1, Conv, [128, 3, 2]]#20
  - [-1, 1, SPDConv, [1]]#21
  - [[-1, 16], 1, Concat, [1]] # 22
  - [-1, 3, C2f_CA, [256]]#23

  - [-1, 1, Conv, [256, 3, 2]]#24
  - [-1, 1, SPDConv, [1]]
  - [[-1, 13], 1, Concat, [1]] #26
  - [-1, 3, C2f_CA, [512]] # 27 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 1, SPDConv, [1]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f_CA, [1024]] # 31 (P5/32-large)

  - [[19, 23, 27, 31], 1, Detect, [nc]] #
